{
    "personal": [
      "May this Diwali bring you closer to your dreams, filling your life with brightness and joy. Happy Diwali!",
      "Wishing you endless moments of happiness and serenity this Diwali. May each light shine with a reason to smile!",
      "As the diyas glow bright, may all your worries fade away, leaving a path of joy and success. Happy Diwali!",
      "May this Diwali illuminate every corner of your heart and life. Stay blessed and happy!",
      "Here’s to a Diwali that lights up your life with all that’s beautiful and meaningful. Have a joyous festival!",
      "Let this Diwali be a reminder of all the good things in life and the joy of new beginnings. Happy Diwali!",
      "Wishing you peace, joy, and all things good this Diwali. May you find new blessings around every corner.",
      "Diwali is the time to celebrate with loved ones. Here’s to laughter, love, and light in abundance for you. Happy Diwali!",
      "May the light of this Diwali guide you to happiness, success, and peace. Have a wonderful celebration!",
      "On this Diwali, may you be blessed with strength, courage, and joy in all you do. Happy Diwali to you!",
      "May the spirit of Diwali bring you warmth, joy, and all the positivity you need for a new beginning.",
      "Wishing you the glow of prosperity, the light of happiness, and all the best this Diwali!",
      "As the diyas burn bright, may your heart be filled with love and joy. Have a blessed Diwali!",
      "May the festival of lights bring all you desire and more. Here’s to celebrating this special time!",
      "Happy Diwali! May this day mark the start of peace, joy, and prosperity in your life.",
      "Sending you love, light, and endless blessings this Diwali. May you shine in all that you do!",
      "This Diwali, may every diyas you light bring a new ray of hope and positivity in your life.",
      "Wishing you a Diwali that sparkles with happiness, prosperity, and laughter. Happy Diwali to you!",
      "May this festival be the start of the best chapter in your life. Here’s to a Diwali filled with joy!",
      "May this Diwali fill your life with love, joy, and countless moments of celebration."
    ],
  
    "professional": [
      "Wishing you a Diwali filled with success, growth, and prosperity. May new opportunities light up your path!",
      "May the festival of lights bring you joy and new ideas. Wishing you a successful and fulfilling Diwali!",
      "This Diwali, may you and your team be blessed with progress and achievements in all endeavors. Happy Diwali!",
      "Warm wishes for a joyous Diwali and a prosperous year ahead. May your hard work shine brightly!",
      "Wishing you a Diwali that marks the beginning of great accomplishments and brighter opportunities!",
      "May this Diwali bring you a spark of new ideas and the success to turn them into reality. Happy Diwali!",
      "Wishing you a Diwali full of inspiration, teamwork, and the energy to create something meaningful.",
      "May the lights of Diwali illuminate your path to success and happiness in all your projects. Happy Diwali!",
      "Here's wishing you a peaceful Diwali and a rewarding year filled with success and growth.",
      "May your hard work be rewarded, and may each light you light lead you to new achievements. Happy Diwali!",
      "Wishing you a Diwali that’s as bright and prosperous as the year ahead. May success be with you!",
      "Here’s to a Diwali that marks a new beginning in your professional journey. Wishing you prosperity and joy!",
      "This Diwali, may your efforts shine and bring you recognition. Happy Diwali and continued success!",
      "As we light diyas, may the spirit of Diwali inspire innovation and collaboration. Wishing you a brilliant Diwali!",
      "May this Diwali bring in renewed focus, positivity, and success in all your professional goals.",
      "Wishing you and your team a Diwali filled with achievements, satisfaction, and new beginnings!",
      "May Diwali bring you the clarity and courage to make your dreams a reality. Happy Diwali!",
      "Wishing you a year of growth, teamwork, and prosperity. May Diwali light the way to your success!",
      "Here’s to a bright Diwali that brings new avenues for success and growth. Happy Diwali!",
      "May the lights of Diwali inspire you toward excellence and fulfillment. Wishing you a successful year!"
    ],
  
    "romantic": [
      "This Diwali, let our love light up the night. Here's to endless happiness together. Happy Diwali, my love!",
      "As we light the diyas, may our love grow brighter with every flicker. Happy Diwali, sweetheart!",
      "You are the light in my life that shines brighter every day. Happy Diwali, my love!",
      "This Diwali, may our love glow and our bond grow stronger. Happy Diwali, my dearest!",
      "With you by my side, every Diwali feels like a festival of endless love and joy. Happy Diwali, my heart!",
      "Wishing you a Diwali as sparkling and bright as your smile. Forever yours, Happy Diwali!",
      "May this Diwali be the start of a new chapter in our love story. Wishing you all my heart’s love!",
      "Let’s celebrate this Diwali with love, joy, and the beauty of togetherness. Happy Diwali, darling!",
      "Every diya I light reminds me of you, lighting up my life with love. Happy Diwali, my love!",
      "You make every moment magical, and this Diwali is no exception. Happy Diwali, my love!",
      "May the fireworks of this Diwali light up our hearts and make us closer than ever. Happy Diwali, my love!",
      "This Diwali, my wish for us is happiness that shines as bright as your love. Happy Diwali, my darling!",
      "Being with you is like celebrating Diwali every day. Here’s to us, my love. Happy Diwali!",
      "You are the reason my life is so bright. Happy Diwali to the love of my life!",
      "This Diwali, let’s make beautiful memories together and cherish our love. Happy Diwali, sweetheart!",
      "May our love be as endless as the lights of Diwali. Happy Diwali to my one and only!",
      "Your love is my light, and this Diwali, I’m grateful for every moment with you. Happy Diwali, love!",
      "As the fireworks light up the sky, may our love shine bright forever. Happy Diwali, my heart!",
      "Here’s to a Diwali filled with love, laughter, and a promise of forever. Happy Diwali, my love!",
      "This Diwali, may our love sparkle and bring us joy in every moment. Happy Diwali, my sweetheart!"
    ],
  
    "family": [
      "Wishing a joyous Diwali to my wonderful family. May our home be filled with love and laughter always!",
      "May this Diwali bring our family closer, filling our home with joy and togetherness. Happy Diwali to all!",
      "Wishing my dearest family a Diwali that’s as bright and joyous as the love we share.",
      "This Diwali, may our family bond grow stronger and our home be filled with happiness. Happy Diwali!",
      "To my loving family, may this Diwali bring countless moments of happiness and harmony. Happy Diwali!",
      "Let’s light up our home and our hearts with the joy of Diwali. Happy Diwali, my dear family!",
      "May the spirit of Diwali bring our family closer, with laughter and joy in every corner. Happy Diwali!",
      "Wishing you all the joy and blessings that Diwali brings. Happy Diwali to my precious family!",
      "To the family I cherish, may this Diwali bring endless happiness and love into our lives.",
      "Happy Diwali to my amazing family. May the light of this festival brighten every day of our lives.",
      "Here’s to a Diwali filled with joy, peace, and the love we share as a family. Happy Diwali!",
      "Sending my love and warm wishes to my family on this beautiful festival. Happy Diwali!",
      "May this Diwali mark the beginning of a year filled with blessings and happiness for our family.",
      "Wishing my family the brightest Diwali filled with love, laughter, and endless memories.",
      "As we celebrate Diwali together, may our hearts be filled with gratitude and happiness. Happy Diwali!",
      "Here’s wishing my family a Diwali that’s as bright as our love and as warm as our togetherness.",
      "May this Diwali fill our lives with peace, happiness, and all that we cherish. Happy Diwali to my family!",
      "To the family that means the world to me, wishing you a Diwali filled with joy and prosperity.",
      "Happy Diwali to my beautiful family. May each diya we light bring us closer to our dreams!",
      "Celebrating the joy of Diwali with my precious family. May this festival fill our lives with love and light!"
    ],
  
    "general": [
      "May the festival of lights bring peace, joy, and prosperity to you and your loved ones. Happy Diwali!",
      "Wishing you a Diwali filled with joy, laughter, and an abundance of blessings. Happy Diwali!",
      "As we light up our homes and hearts, may this Diwali bring you all the happiness you deserve.",
      "Happy Diwali! May the lights of this festival bring brightness into your life and fill it with positivity.",
      "Wishing you a prosperous Diwali that marks the start of new beginnings. Happy Diwali to you and yours!",
      "May this Diwali bring peace, prosperity, and happiness in every moment. Happy Diwali!",
      "Sending warm Diwali wishes to you and your family. May you be blessed with joy and success!",
      "Happy Diwali! May the festival of lights brighten up your life with health, happiness, and prosperity.",
      "May this Diwali light up your life with love and laughter, and fill your days with endless joy.",
      "Here’s to a Diwali filled with positivity, prosperity, and peace. Wishing you a wonderful festival!",
      "May this Diwali be a harbinger of joy and new opportunities for you. Have a blessed Diwali!",
      "Wishing you the brightest Diwali and a year filled with abundance and success. Happy Diwali!",
      "Happy Diwali to you! May the lights of this festival bring warmth and happiness to your heart.",
      "This Diwali, may your life be filled with happiness, peace, and all things beautiful. Happy Diwali!",
      "Wishing you a Diwali that’s as beautiful and bright as the lights around us. Happy Diwali!",
      "May the joy of Diwali fill your home with health, wealth, and peace. Happy Diwali to you and yours!",
      "Wishing you a memorable Diwali filled with laughter, love, and countless blessings.",
      "May this Diwali bring endless moments of joy, peace, and success to you and your loved ones.",
      "Happy Diwali! May the festival of lights bring happiness, prosperity, and joy to your heart.",
      "Wishing you and your loved ones a joyful Diwali and a year filled with peace and happiness!"
    ]
  }
  